Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties.AxisModifierZ Property
 The axis modifier in the Z direction.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartPositionProperties.AxisModifierEnum AxisModifierZ { get; set; }
Public Property AxisModifierZ As AnalysisPartPositionProperties.AxisModifierEnum
	Get
	Set
Property Value
Type: AnalysisPartPositionProperties.AxisModifierEnum
See Also
Reference
AnalysisPartPositionProperties Class
Tekla.Structures.Analysis Namespace